Задание 1

In [17]:
import datetime
from datetime import datetime, timedelta

In [18]:
date_string = 'May 9 2017 9:00AM' 
datetime.strptime(date_string, '%b %d %Y %H:%M%p')

datetime.datetime(2017, 5, 9, 9, 0)

In [19]:
date_datetime = datetime.strptime(date_string, '%b %d %Y %H:%M%p')
type(date_datetime)

datetime.datetime

In [20]:
date_datetime.hour

9

Задание 2

In [21]:
startDate = 'May 9 2017 9:00AM' 
startDate_datetime = datetime.strptime(startDate,'%b %d %Y %H:%M%p')

In [22]:
startDate_datetime += timedelta(hours=1)
startDate_datetime

datetime.datetime(2017, 5, 9, 10, 0)

Задание 3

In [23]:
startDate_datetime.strftime( '%Y-%m-%d' )

'2017-05-09'

Задание 4

In [27]:
startDate = '2017-01-01 00:00:00'
endDate = '2017-01-03 00:00:00'

def date_range(start_date, end_date):
    date_range_list = []
    current_date = start_date  
    current_date_dt = datetime.strptime(start_date, '%Y-%m-%d %H:%M:%S')
    end_date_dt = datetime.strptime(end_date, '%Y-%m-%d %H:%M:%S')   
    while current_date_dt <= end_date_dt:
        date_range_list.append(current_date)        
        current_date_dt += timedelta(seconds=1)
        current_date = current_date_dt.strftime('%Y-%m-%d %H:%M:%S')    
    return date_range_list

In [29]:
list1=date_range(startDate, endDate)

In [34]:
def myfunc(list1):
    current_date = '2017-01-03 00:00:00'
    current_date_df = datetime.strptime(current_date, '%Y-%m-%d %H:%M:%S')  
    end_date = '2017-01-01 00:00:00'
    end_date_df=datetime.strptime(end_date, '%Y-%m-%d %H:%M:%S')
    while end_date_df < current_date_df:
        end_date = end_date_df.strftime('%Y-%m-%d %H:%M:%S')
        end_date_df += timedelta(seconds=1)
    return end_date

In [35]:
myfunc(list1)

'2017-01-02 23:59:59'

ЗАДАНИЕ
Для завершения подсчета lifetime вам необходимо сделать следующее:

Сгруппировать датафрейм data по столбцу user_id, посчитав для столбца unixtime максимальное и минимальное значение для каждого пользователя.
Посчитать столбец diff с разностью максимального и минимального значения столбца unixtime из пункта 1.
Исключить из расчета пользователей, у которых разница diff равна 0.
Посчитать среднее значение столбца diff после фильтрации.
Вы получите ответ в секундах. Пересчитайте его в количество дней.
Каково значение lifetime в днях? Результат округлите до первого знака после запятой.

In [36]:
import pandas as pd
data = pd.read_csv('https://raw.githubusercontent.com/dm-fedorov/pandas_basic/master/data/data.tsv', sep='\t')
data.head()

,id,date,user_id,duration,medium,source,cost,order_id,amount_paid
0,40443,05.10.2016 23:18,1010,0.000926,seo,google,0.00,6243,20.2
1,35044,09.10.2016 21:40,1036,0.006493,sem,yandex,0.07,6145,15.6
2,40177,05.10.2016 3:23,1041,0.003380,email,promo,0.00,6128,13.2
3,39401,05.10.2016 23:19,1041,0.000463,sem,yandex,0.03,6697,9.8
4,41545,01.10.2016 4:57,1042,0.006493,sem,google,0.06,4510,14.8

In [37]:
def convert_to_datetime(row):
    return datetime.strptime(row['date'], '%d.%m.%Y %H:%M')

In [38]:
data['datetime'] = data.apply(convert_to_datetime, axis=1)
data.head()

,id,date,user_id,duration,medium,source,cost,order_id,amount_paid,datetime
0,40443,05.10.2016 23:18,1010,0.000926,seo,google,0.00,6243,20.2,2016-10-05 23:18:00
1,35044,09.10.2016 21:40,1036,0.006493,sem,yandex,0.07,6145,15.6,2016-10-09 21:40:00
2,40177,05.10.2016 3:23,1041,0.003380,email,promo,0.00,6128,13.2,2016-10-05 03:23:00
3,39401,05.10.2016 23:19,1041,0.000463,sem,yandex,0.03,6697,9.8,2016-10-05 23:19:00
4,41545,01.10.2016 4:57,1042,0.006493,sem,google,0.06,4510,14.8,2016-10-01 04:57:00

In [39]:
import time
def make_unix_time(row):
    return time.mktime(row['datetime'].timetuple())

In [40]:
data['unixtime'] = data.apply(make_unix_time, axis=1)
data.head()

,id,date,user_id,duration,medium,source,cost,order_id,amount_paid,datetime,unixtime
0,40443,05.10.2016 23:18,1010,0.000926,seo,google,0.00,6243,20.2,2016-10-05 23:18:00,1.475699e+09
1,35044,09.10.2016 21:40,1036,0.006493,sem,yandex,0.07,6145,15.6,2016-10-09 21:40:00,1.476038e+09
2,40177,05.10.2016 3:23,1041,0.003380,email,promo,0.00,6128,13.2,2016-10-05 03:23:00,1.475627e+09
3,39401,05.10.2016 23:19,1041,0.000463,sem,yandex,0.03,6697,9.8,2016-10-05 23:19:00,1.475699e+09
4,41545,01.10.2016 4:57,1042,0.006493,sem,google,0.06,4510,14.8,2016-10-01 04:57:00,1.475287e+09

In [44]:
minim=data.groupby(['user_id'])[['unixtime']].min()

In [45]:
minim

             unixtime
user_id
1010     1.475699e+09
1036     1.476038e+09
1041     1.475627e+09
1042     1.475287e+09
1047     1.475318e+09
...               ...
1393     1.475721e+09
1394     1.475614e+09
1397     1.475633e+09
1398     1.475697e+09
1424     1.475330e+09

[124 rows x 1 columns]

In [46]:
maxim=data.groupby(['user_id'])[['unixtime']].max()

In [47]:
maxim

             unixtime
user_id
1010     1.475699e+09
1036     1.476038e+09
1041     1.475699e+09
1042     1.475934e+09
1047     1.475693e+09
...               ...
1393     1.475721e+09
1394     1.475614e+09
1397     1.475633e+09
1398     1.475697e+09
1424     1.476052e+09

[124 rows x 1 columns]

In [50]:
new=data.groupby(['user_id'])[['unixtime']].agg(['max','min'])
new.head()

             unixtime
                  max           min
user_id
1010     1.475699e+09  1.475699e+09
1036     1.476038e+09  1.476038e+09
1041     1.475699e+09  1.475627e+09
1042     1.475934e+09  1.475287e+09
1047     1.475693e+09  1.475318e+09

In [76]:
d=new.unixtime['max']-new.unixtime['min']

124

In [86]:
users=[]
for i in range(len(d)):
    users.append(int(d.index[i]))

In [93]:
witout_0=[]
walues=[]
for i in users:
    if d[i]!=0.0:
        witout_0.append(i)
        walues.append(d[i])

In [94]:
witout_0

[1041,
 1042,
 1047,
 1052,
 1057,
 1100,
 1108,
 1112,
 1113,
 1114,
 1118,
 1123,
 1134,
 1135,
 1136,
 1140,
 1145,
 1149,
 1154,
 1159,
 1182,
 1193,
 1198,
 1203,
 1207,
 1208,
 1213,
 1218,
 1223,
 1226,
 1228,
 1233,
 1238,
 1243,
 1246,
 1248,
 1252,
 1253,
 1258,
 1263,
 1267,
 1268,
 1273,
 1278,
 1283,
 1288,
 1293,
 1298,
 1300,
 1303,
 1308,
 1313,
 1318,
 1323,
 1328,
 1424]

In [99]:
from statistics import mean
meanw=mean(walues)

In [103]:
meanw=round(meanw)

In [110]:
difference=round(meanw/(3600*24),1)

In [111]:
difference

3.5